Repository: TelegramMessenger/Telegram-iOS
Catalog: Resources/*.lproj/HockeySDK.strings
Languages: hu, it, ja, nl, ro, ru

# HockeyYes
source: Yes
hu: Igen
it: Sì
ja: はい
nl: Ja
ro: Da
ru: Да

# HockeyNo
source: No
hu: Nem
it: Non inviare
ja: いいえ
nl: Nee
ro: Nu
ru: Нет

# HockeyAppNamePlaceholder
source: This app
hu: Az alkalmazás
it: Questa app
ja: このApp
nl: Deze app
ro: Aplicația curentă
ru: Эта программа

# CrashDataFoundTitle
source: %@ Unexpectedly Quit
hu: %@ váratlanul kilépett
it: %@ si è chiusa inaspettatamente
ja: %@が予期しない理由で終了
nl: %@ is onverwacht gestopt
ro: Raportare eroare
ru: Неожиданное завершение %@

# CrashDataFoundAnonymousDescription
source: Would you like to send an anonymous report so we can fix the problem?
hu: Szeretne hibajelentést küldeni, hogy javíthassuk a problémát? A küldés névtelenül történik.
it: Vuoi inviare un report anonimo per aiutarci a risolvere il problema?
ja: 問題が修正できるよう、匿名のレポートを送信しますか。
nl: Wilt u een anoniem rapport versturen zodat we het probleem kunnen oplossen?
ro: Doriți să trimiteți un raport anonim ca să putem corecta problema?
ru: Пошлете анонимный отчет, чтобы мы могли исправить эту ошибку?

# CrashDataFoundDescription
source: Would you like to send a report so we can fix the problem?
hu: Szeretne hibajelentést küldeni, hogy javíthassuk a problémát?
it: Vuoi inviare un report con i dettagli del crash per aiutarci a risolvere il problema?
ja: 問題が修正できるよう、レポートを送信しますか。
nl: Wilt u een rapport versturen zodat we het probleem kunnen oplossen?
ro: Doriți să trimiteți un raport ca să putem corecta problema??
ru: Пошлете отчет, чтобы мы могли исправить эту ошибку?

# CrashSendReportAlways
source: Always Send
hu: Mindig küldjön
it: Invia sempre
ja: 常に送信
nl: Verstuur altijd
ro: Trimite mereu
ru: Отправлять всегда

# CrashSendReport
source: Send Report
hu: Jelentés küldése
it: Invia
ja: レポートを送信
nl: Verstuur rapport
ro: Trimite raport
ru: Отправить отчет

# CrashDontSendReport
source: Don't Send
hu: Ne küldjön
it: Non inviare
ja: 送信しない
nl: Verstuur niet
ro: Nu trimite
ru: Не отправлять

# CrashReportSending
source: Sending…
hu: Küldés…
it: Invio...
ja: 送信中…
nl: Versturen…
ro: Se trimite…
ru: Отправка...

source: Update available
hu: Frissítés elérhető
it: Nuovo aggiornamento
ja: アップデートあり
nl: Update beschikbaar
ro: Versiune nouă
ru: Имеется обновление

# UpdateAlertTextWithAppVersion
source: %@ is available.
hu: %@ elérhető.
it: È disponibile %@.
ja: %@が入手できます。
nl: %@ is beschikbaar.
ro: A apărut versiunea %@.
ru: Доступно: %@.

# UpdateAlertMandatoryTextWithAppVersion
source: %@ is available and is a mandatory update!
hu: %@ elérhető, és szükséges frissíteni!
it: È disponibile %@ ed è un aggiornamento obbligatorio!
ja: 必須アップデート%@が利用可能です！
nl: %@ is beschikbaar en is een verplichte update!
ro: A apărut versiunea %@ și actualizarea e obligatorie!
ru: Доступно обязательное обновление %@!

# UpdateIgnore
source: Ignore
hu: Most nem
it: Ignora
ja: 無視
nl: Negeer
ro: Ignoră
ru: Игнорировать

# UpdateShow
source: Show
hu: Megjelenítés
it: Visualizza
ja: 表示
nl: Toon
ro: Arată
ru: Показать

# UpdateInstall
source: Install
hu: Telepítés
it: Installa
ja: インストール
nl: Installeer
ro: Instalează
ru: Установить

# UpdateRemindMe
source: Remind me
hu: Emlékeztessen később
it: Ricordamelo
ja: 後で通知
nl: Herinner me
ru: Напомнить

# UpdateScreenTitle
source: Update
hu: Frissítés
it: Aggiornamento
ja: アップデート
ro: Actualizare
ru: Обновление

# UpdateButtonCheck
source: CHECK
hu: ELLENŐRZÉS
it: VERIFICA
ja: 確認
nl: CONTROLEER
ro: VERIFICĂ
ru: ПРОВЕРИТЬ

# UpdateButtonSearching
source: CHECKING
hu: KERESÉS
it: VERIFICO
ja: 確認中
nl: CONTROLEREN
ro: SE VERIFICĂ
ru: ПРОВЕРКА

# UpdateButtonUpdate
source: UPDATE
hu: FRISSÍTÉS
it: AGGIORNA
ja: アップデート
nl: WERK BIJ
ro: ACTUALIZEAZĂ
ru: ОБНОВИТЬ

# UpdateButtonInstalling
source: INSTALLING
hu: TELEPÍTÉS
it: INSTALLO
ja: インストール中
nl: INSTALLEREN
ro: SE INSTALEAZĂ
ru: УСТАНОВКА

# UpdateButtonOffline
source: OFFLINE
hu: NINCS KAPCSOLAT
ja: オフライン
ru: ОФЛАЙН

# UpdateInstalled
source: INSTALLED
hu: TELEPÍTVE
it: INSTALLATO
ja: インストール済み
nl: GEÏNSTALLEERD
ro: INSTALAT
ru: УСТАНОВЛЕНО

# UpdateVersion
source: Version
hu: verzió
it: Versione
ja: バージョン
nl: Versie
ro: Versiune
ru: Версия

# UpdateShowPreviousVersions
source: Show previous versions...
hu: Korábbi verziók megtekintése…
it: Visualizzo versioni precedenti...
ja: 前のバージョンを表示…
nl: Toon vorige versies...
ro: Arată versiunile anterioare...
ru: Показать предыдущие версии...

# UpdateNoUpdateAvailableTitle
source: No Update Available
hu: Nincs elérhető frissítés
it: Non sono disponibili aggiornamenti
ja: アップデートなし
nl: Geen update beschikbaar
ro: Nici o actualizare disponibilă
ru: Нет обновлений

# UpdateNoUpdateAvailableMessage
source: %@ is already the latest version.
hu: %@ már a legfrissebb verzió.
it: %@ è già la versione attuale.
ja: %@は現在入手できる最新バージョンです。
nl: %@ is al de nieuwste versie.
ro: %@ e cea mai recentă versiune.
ru: %@: самая новая версия.

# UpdateError
source: Error
hu: Hiba
it: Errore
ja: エラー
nl: Fout
ro: Eroare
ru: Ошибка

# UpdateWarning
source: Warning
hu: Figyelmeztetés
it: Avviso
ja: 警告
nl: Waarschuwing
ro: Avertisment
ru: Предупреждение

# UpdateNoReleaseNotesAvailable
source: No release notes available.
hu: Nem elérhető a változások listája.
it: Non sono disponibili note sulla release.
ja: リリースノートがありません。
nl: Geen versiebeschrijvingen beschikbaar.
ro: Nu există note.
ru: Нет комментариев по этой версии.

# UpdateAuthorizationProgress
source: Authorizing...
hu: Engedélyezés…
it: Autorizzazione...
ja: 認証中…
nl: Identiteit controleren...
ro: Se authorizează...
ru: Авторизация...

# UpdateAuthorizationOffline
source: Internet connection required!
hu: Internetkapcsolat szükséges!
it: È necessario un collegamento a Internet!
ja: インターネット接続が必要です！
nl: Internetverbinding vereist!
ro: Necesită conexiune la Internet!
ru: Нужно подключить Интернет!

# UpdateAuthorizationDenied
source: Authorizing denied. Please contact the developer.
hu: Engedélyezés megtagadva. Lépjen kapcsolatba a fejlesztővel.
it: Autorizzazione negata. Contattare lo sviluppatore.
ja: 認証が拒否されました。デベロッパに連絡してください。
nl: Identiteitscontrole geweigerd. Neem contact op met de ontwikkelaar.
ro: Autorizare refuzată. Vă rugăm contactați dezvoltatorul.
ru: Отказано в авторизации. Свяжитесь с разработчиком.

# UpdateExpired
source: %@ is expired and can not be used any longer.
hu: %@ érvényessége lejárt, és már nem használható.
it: %@ è scaduta e non può più essere utilizzata.
ja: %@の有効期限が切れたため、これ以上使用できません。
nl: %@ is verlopen en kan niet langer worden gebruikt.
ro: %@ a expirat și nu mai poate fi folosită.
ru: Срок использования %@ истек, использование прекращено.

# UpdateSimulatorMessage
source: Hockey Update does not work in the Simulator. The itms-services:// url scheme is implemented but nonfunctional.
hu: A Hockey Update nem használható a szimulátorban. Az itms-services:// URL séma elérhető, de nem működőképes.
it: L'aggiornamento di Hockey non funziona nel Simulator. Lo schema url tms-services:// è implementato ma non è funzionante.
ja: HockeyのアップデートはSimulatorでは作動しません。 itms-services:// のURL方式は実装されていますが、機能しません。
nl: Hockey Update werkt niet in de Simulator. Het URL-schema voor itms-voorzieningen:// is geïmplementeerd maar niet functioneel.
ro: Hockey Update nu funcționează în simulator. Schema itms-services:// este implementată dar nefuncțională.
ru: Hockey Update не работает в Simulator. Схема itms-services:// url применена, но не работает.

# HockeyFeedbackNewMessageTitle
source: New Feedback Response
hu: Új válasz
it: Nuova risposta a un commento
ja: 新規フィードバックの応答
nl: Nieuwe reactie op feedback
ro: Nou răspuns feedback
ru: Новый ответ на отклик

# HockeyFeedbackNewMessageText
source: A new response to your feedback is available. Would you like to view it?
hu: Új válasz érkezett az Ön visszajelzésére. Kívánja most megtekinteni?
it: C'è una nuova risposta al tuo commento. Vuoi visualizzarla?
ja: フィードバックに対する新しい応答があります。表示しますか。
nl: Er is een nieuwe reactie op uw feedback. Wilt u deze bekijken?
ro: A apărut un nou răspuns la feedback-ul dvs. Doriți să îl vedeți?
ru: Поступил новый ответ на ваш отклик. Просмотреть его?

# HockeyFeedbackIgnore
source: Ignore
hu: Most nem
it: Ignora
ja: 無視
nl: Negeer
ro: Ignoră
ru: Игнорировать

# HockeyFeedbackShow
source: Show
hu: Megtekintés
it: Visualizza
ja: 表示
nl: Toon
ro: Arată
ru: Показать

# HockeyFeedbackListTitle
source: Feedback
hu: Visszajelzés
it: Commento
ja: フィードバック
ru: Отклик

# HockeyFeedbackListLastUpdated
source: Last Updated: %@
hu: Utolsó frissítés: %@
it: Ultimo aggiornamento: %@
ja: 前回のアップデート：%@
nl: Laatst bijgewerkt: %@
ro: Ultima actualizare: %@
ru: Последнее обновление: %@

# HockeyFeedbackListNeverUpdated
source: Never
hu: Soha
it: Mai
ja: しない
nl: Nooit
ro: Niciodată
ru: Не было

# HockeyFeedbackListButonWriteFeedback
source: Provide Feedback
hu: Visszajelzés küldése
ja: フィードバックを送信
nl: Stuur feedback
ro: Furnizează Feedback

# HockeyFeedbackListButonWriteResponse
source: Add a Response
hu: Válasz küldése
ja: 応答を追加
nl: Voeg een reactie toe
ro: Adaugă un răspuns

# HockeyFeedbackListButonUserDataSetName
source: Set Your Name
hu: Adja meg a nevét
ja: 名前を設定
nl: Stel uw naam in
ro: Introduceți numele

# HockeyFeedbackListButonUserDataSetEmail
source: Set Your Email
hu: Adja meg az e-mail címét
ja: メールを設定
nl: Stel uw e-mail in
ro: Introduceți e-mail

# HockeyFeedbackListButonUserDataWithName
source: Name: %@
hu: Név: %@
ja: 名前：%@
nl: Naam: %@
ro: Nume: %@

# HockeyFeedbackListButonUserDataWithEmail
source: Email: %@
ja: メール：%@

# HockeyFeedbackListButonDeleteAllMessages
source: Delete All Messages
hu: Összes üzenet törlése
ja: すべてのメッセージを削除
nl: Verwijder alle berichten
ro: Șterge toate mesajele

# HockeyFeedbackListMessagePending
source: Pending
hu: Folyamatban
it: In attesa
ja: 保留中
nl: In wachtrij
ro: În aștepare
ru: Ожидание

# HockeyFeedbackListDeleteAllTitle
source: This will delete all messages on this device.
hu: Minden üzenet törlődni fog erről az eszközről.
it: Tutti i messaggi presenti sul dispositivo saranno cancellati.
ja: この操作はこのデバイスのメッセージすべてを削除します。
nl: Dit verwijdert alle berichten op dit apparaat.
ro: Toate mesajele de pe acest dispozitiv vor fi șterse.
ru: Этим действием будут стерты все сообщения на этом устройстве.

# HockeyFeedbackListDeleteAllDelete
source: Delete
hu: Törlés
it: Cancella
ja: 消去
nl: Verwijder
ro: Șterge
ru: Удалить

# HockeyFeedbackListDeleteAllCancel
source: Cancel
hu: Mégsem
it: Annulla
ja: キャンセル
nl: Annuleer
ro: Anulează
ru: Отменить

# HockeyFeedbackListLinkActionCancel
source: Cancel
hu: Mégsem
it: Annulla
ja: キャンセル
nl: Annuleer
ro: Anulează
ru: Отменить

# HockeyFeedbackListLinkActionOpen
source: Open
hu: Megnyitás
it: Apri
ja: 開く
ro: Deschide
ru: Открыть

# HockeyFeedbackListLinkActionCopy
source: Copy
hu: Másolás
it: Copia
ja: コピー
nl: Kopieer
ro: Copiază
ru: Копировать

# HockeyFeedbackActivityButtonTitle
source: %@ Feedback
hu: Visszajelzés: %@
it: Commento su %@
ja: %@フィードバック
nl: Feedback over %@
ro: Feedback pentru %@
ru: Отклик на %@

# HockeyFeedbackComposeTitle
source: New Feedback
hu: Új visszajelzés
it: Nuovo commento
ja: 新規フィードバック
nl: Nieuwe feedback
ro: Nou feedback
ru: Новый

# HockeyFeedbackComposeSend
source: Send
hu: Küldés
it: Invia
ja: 送信
nl: Verstuur
ro: Trimite
ru: Отправить

# HockeyFeedbackUserDataTitle
source: My Info
hu: Felhasználói adatok
it: Le mie info
ja: 自分の情報
nl: Mijn info
ro: Informațiile mele
ru: Мои данные

# HockeyFeedbackUserDataDescription
source: Please provide your information before writing your feedback.
hu: Kérjük, adja meg néhány adatát, mielőtt megírja a visszajelzést.
it: Prima di scrivere il commento inserisci i tuoi dati.
ja: フィードバックを記入する前に情報を入力してください。
nl: Geef uw gegevens op alvorens uw feedback te schrijven.
ro: Vă rugăm introduceți informațiile despre dvs.
ru: Перед отправкой отклика необходимо ввести ваши личные данные.

# HockeyFeedbackUserDataName
source: Name
hu: Név
it: Nome
ja: 名前
nl: Naam
ro: Nume
ru: Имя

# HockeyFeedbackUserDataNamePlaceHolder
source: John Doe
hu: Gipsz Jakab
it: Mario Rossi
ja: Hiromi Sato
nl: Jan Smit
ro: Ion Popescu
ru: Имя

# HockeyFeedbackUserDataEmail
source: Email
ja: メール

# HockeyAuthenticationViewControllerWebUDIDLoginDescription
source: The developer has requested this device's UDID. Tap below to open the HockeyApp website and authorize access.
hu: A fejlesztő szeretné hozzáférni készüléke UDID azonosítójához. Kattintással nyissa meg a HockeyApp weblapot és engedélyezze a hozzáférést.
it: Lo sviluppatore ha richiesto l'UDID di questo dispositivo. Tocca in basso per aprire il sito di HockeyApp e autorizza l'accesso.
ja: デベロッパからこのデバイスのUDIDを要求されています。以下をタップしてHockeyAppウェブサイトを開き、アクセスを認証してください。
nl: De ontwikkelaar heeft de UDID van dit apparaat gevraagd. Tik hieronder om de website van HockeyApp te openen en toegang te verlenen.
ru: Разработчик запросил UDID этого устройства. Нажмите на ссылку ниже, чтобы открыть сайт HockeyApp и авторизовать доступ.

# HockeyAuthenticationViewControllerWebLoginButtonTitle
source: Open HockeyApp
hu: HockeyApp megnyitása
it: Apri HockeyApp
ja: HockeyAppを開く
ru: Открыть HockeyApp

# HockeyAuthenticationViewControllerWebAuthLoginDescription
source: The developer has requested your HockeyApp account's email address. Tap below to open the HockeyApp website and authorize access.
hu: A fejlesztő szeretné hozzáférni a HockeyApp fiókjának e-mail címéhez. Kattintással nyissa meg a HockeyApp weblapot és engedélyezze a hozzáférést.
it: Lo sviluppatore ha richiesto l'indirizzo e-mail del tuo account HockeyApp. Tocca in basso per aprire il sito di HockeyApp e autorizza l'accesso.
ja: デベロッパからHockeyAppアカウントのメールアドレスを要求されています。以下をタップしてHockeyAppウェブサイトを開き、アクセスを認証してください。
nl: De ontwikkelaar heeft het e-mailadres van uw HockeyApp-account gevraagd. Tik hieronder om de website van HockeyApp te openen en toegang te verlenen.
ru: Разработчик запросил email аккаунта HockeyApp. Нажмите на ссылку внизу, чтобы попасть на сайт HockeyApp и авторизовать доступ.

# HockeyAuthenticationViewControllerDataEmailAndPasswordDescription
source: Please enter your HockeyApp account's email address and password to authorize access to this app.
hu: Kérjük, adja meg HockeyApp fiókjához tartozó e-mail címét és jelszavát az alkalmazáshoz történő hozzáférés engedélyezéséhez.
it: Inserisci l'indirizzo e-mail e la password del tuo account HockeyApp per autorizzare l'accesso a questa app.
ja: HockeyAppアカウントのメールアドレスとパスワードを入力し、このAppへのアクセスを認証してください。
nl: Voer het e-mailadres en wachtwoord van uw HockeyApp-account in om toegang tot deze app te verlenen.
ru: Введите email и пароль аккаунта HockeyApp, чтобы авторизовать доступ к этому приложению.

# HockeyAuthenticationViewControllerDataEmailDescription
source: Please enter your HockeyApp account's email address to authorize access to this app.
hu: Kérjük, adja meg HockeyApp fiókjához tartozó e-mail címét az alkalmazáshoz történő hozzáférés engedélyezéséhez.
it: Inserisci l'indirizzo e-mail del tuo account HockeyApp per autorizzare l'accesso a questa app.
ja: HockeyAppアカウントのメールアドレスを入力し、このAppへのアクセスを認証してください。
nl: Voer het e-mailadres van uw HockeyApp-account in om toegang tot deze app te verlenen.
ru: Введите email аккаунта HockeyApp, чтобы авторизовать доступ к этому приложению.

# HockeyAuthenticationViewControllerPasswordPlaceholder
source: Required
hu: Szükséges mező
it: Richiesto
ja: 必須
nl: Verplicht
ru: Обязательное поле

# HockeyAuthenticationViewControllerEmailDescription
source: Email
ja: メール

# HockeyAuthenticationViewControllerPasswordDescription
source: Password
hu: Jelszó
ja: パスワード
nl: Wachtwoord
ru: Пароль

# HockeyAuthenticationViewControllerNetworkError
source: Failed to authorize because your device appears to be disconnected from the Internet. Please try again.
hu: A hitelesítés sikertelen, mert készüléke nem csatlakozik az internethez. Kérjük, próbálja meg később újra.
it: Autorizzazione non riuscita. Pare che il dispositivo non sia connesso a Internet. Riprova.
ja: デバイスがインターネットに接続されていないため、認証できません。やり直してください。
nl: Identiteitscontrole mislukt omdat uw apparaat niet is verbonden met het internet. Probeer opnieuw.
ru: Не удалось авторизоваться, так как ваше устройство не подключено к интернету. Попробуйте еще раз

# HockeyAuthenticationFailedAuthenticate
source: Failed to authorize. Please try again or contact the developer of this app.
hu: A hitelesítés sikertelen. Kérjük, próbálja meg később újra vagy lépjen kapcsolatba az alkalmazás fejlesztőjével.
it: Autorizzazione non riuscita. Riprova o contatta lo sviluppatore di questa app.
ja: 認証できませんでした。やり直すか、このAppのデベロッパに連絡してください。
nl: Identiteitscontrole mislukt. Probeer opnieuw of neem contact op met de ontwikkelaar van deze app.
ru: Авторизация не удалась. Попробуйте еще раз или свяжитесь с разработчиком приложения.

# HockeyAuthenticationNotMember
source: You are not authorized to use this app. Please contact the developer of this app.
hu: Nem jogosult az alkalmazás használatára. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.
it: Non sei autorizzato a usare questa app. Contatta lo sviluppatore di questa app.
ja: このAppの使用を認証されていません。このAppのデベロッパに連絡してください。
nl: U bent niet gemachtigd om deze app te gebruiken. Neem contact op met de ontwikkelaar van deze app.
ru: У вас нет разрешения использовать это приложение. Обратитесь к разработчику приложения.

# HockeyAuthenticationContactDeveloper
source: Authorization error. Please contact the developer of this app.
hu: Hitelesítési hiba. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.
it: Errore di autorizzazione. Contatta lo sviluppatore di questa app.
ja: 認証エラー。このAppのデベロッパに連絡してください。
nl: Fout bij identiteitscontrole. Neem contact op met de ontwikkelaar van deze app.
ru: Ошибка авторизации. Свяжитесь с разработчиком приложения.

# HockeyAuthenticationWrongEmailPassword
source: You have entered an invalid email or password. Please check your input and try again.
hu: Érvénytelen e-mail címet vagy jelszót adott meg. Kérjük, ellenőrizze a bevitelt és adja meg az adatokat újra.
it: L'indirizzo e-mail o la password non sono corretti. Controlla i dati inseriti e riprova.
ja: 無効なメールアドレスまたはパスワードが入力されました。入力を確認し、やり直してください。
nl: U hebt een ongeldig e-mailadres of wachtwoord ingevoerd. Controleer uw gegevens en probeer opnieuw.
ru: Вы ввели неверный email или пароль. Проверьте его правильность и попробуйте еще раз.

# HockeyAuthenticationAuthSecretMissing
source: The HockeySDK authorization secret has not been set. Please contact the developer of this app.
hu: A HockeySDK "authorization secret" még nincs beállítva. Kérjük, lépjen kapcsolatba az alkalmazás fejlesztőjével.
it: Non è stato impostato l'"authorization secret" HockeySDK. Contatta lo sviluppatore di questa app.
ja: HockeySDK “authorization secret” が設定されていません。このAppのデベロッパに連絡してください。
nl: Het 'Authorization secret' van HockeySDK is nog niet ingesteld. Neem contact op met de ontwikkelaar van deze app.
ru: HockeySDK authorization secret не настроен. Свяжитесь с разработчиком приложения.

# HockeyFeedbackActivityAppPlaceholder
source: App
hu: az alkalmazásról
ro: Aplicație
ru: Программа

# HockeyFeedbackUserDataEmailPlaceholder
source: email@example.com
it: email@esempio.com
nl: e-mail@voorbeeld.com
ro: exemplu@email.ro

# HockeyAuthenticationViewControllerEmailPlaceholder
source: email@example.com
it: email@esempio.com
nl: mail@voorbeeld.com
