Repository: TelegramMessenger/Telegram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/InfoPlist.strings
Languages: nl, ru

# NSContactsUsageDescription
source: Nicegram will continuously upload your contacts to its heavily encrypted cloud servers to let you connect with your friends across all your devices.
nl: Nicegram synchroniseert je contacten continu naar onze zwaar versleutelde Cloud-servers, zodat je contact kunt opnemen met je vrienden vanaf al je apparaten.
ru: Актуальная информация о ваших контактах будет храниться зашифрованной в облаке Nicegram, чтобы вы могли связаться с друзьями с любого устройства.

# NSLocationWhenInUseUsageDescription
source: When you send your location to your friends, Nicegram needs access to show them a map.
nl: Als je je locatie met vrienden wilt delen heeft Nicegram toegang nodig om ze een kaart te kunnen tonen.
ru: Когда вы отправляете друзьям геопозицию, Nicegram нужно разрешение, чтобы показать им карту.

# NSLocationAlwaysUsageDescription
source: When you choose to share your live location with friends in a chat, Nicegram needs background access to your location to keep them updated for the duration of the live sharing. You also need this to send locations from an Apple Watch.
nl: Nicegram heeft toegang nodig om een kaart aan je vrienden te tonen als je jouw locatie met ze deelt. Je hebt dit ook nodig om locaties te sturen vanaf een Apple Watch.
ru: Фоновый доступ к геопозиции требуется, чтобы обновлять вашу геопозицию, когда вы транслируете её в чат с друзьями. Он также необходим для отправки геопозиции с Apple Watch.

# NSCameraUsageDescription
source: We need this so that you can take and share photos and videos.
nl: We hebben dit nodig zodat je foto's en video's kunt maken en delen.
ru: Это необходимо, чтобы вы могли делиться снятыми фотографиями и видео.

# NSPhotoLibraryUsageDescription
source: We need this so that you can share photos and videos from your photo library.
nl: We hebben dit nodig zodat je foto's en video's kunt delen vanuit je fotobibliotheek.
ru: Это необходимо, чтобы вы могли делиться фото и видео из библиотеки устройства.

# NSPhotoLibraryAddUsageDescription
source: We need this so that you can save photos and videos to your photo library.
nl: We hebben dit nodig zodat je foto's en video's kunt opslaan in je fotobibliotheek.
ru: Это необходимо, чтобы вы могли сохранять фото и видео в библиотеку устройства.

# NSMicrophoneUsageDescription
source: We need this so that you can record and share voice messages and videos with sound.
nl: We hebben dit nodig zodat je spraakberichten en video's met geluid kunt opnemen en delen.
ru: Это необходимо, чтобы вы могли делиться голосовыми сообщениями и видео со звуком.

# NSSiriUsageDescription
source: You can use Siri to send messages.
nl: Je kunt Siri gebruiken om berichten te sturen
ru: Вы можете использовать Siri для отправки сообщений

# NSLocationAlwaysAndWhenInUseUsageDescription
source: When you choose to share your Live Location with friends in a chat, Nicegram needs background access to your location to keep them updated for the duration of the live sharing.
nl: Als je ervoor kiest om je huidige locatie te delen met vrienden in een chat heeft Nicegram achtergrondtoegang tot je locatie nodig om deze bij te werken tijdens het live-delen.
ru: Фоновый доступ к геопозиции требуется, чтобы обновлять вашу геопозицию, когда вы транслируете её в чат с друзьями.

# NSFaceIDUsageDescription
source: You can use Face ID to unlock the app.
nl: Je kunt Face ID gebruiken om de app te ontgrendelen.
ru: Вы можете разблокировать приложение с помощью Face ID.
