Repository: TelegramMessenger/Telegram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/NiceLocalizable.strings
Languages: de, fa, ro, uk

# NiceFeatures.Notifications.HideNotifyAccountNotice
source: Instead of «User → Account» you will see only «User». For multiple accounts only.
ro: În loc de «Utilizator → Cont», veți vedea doar «Utilizator». Numai pentru mai multe conturi.
