Repository: TelegramMessenger/Telegram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/NicegramLocalizable.strings
Languages: pt

# Nicegram.Assistant.Title
source: Nicegram Assistant
pt: Assistente Nicegram

# Nicegram.Assistant.MobileData
source: Mobile Data
pt: Dados móveis

# Nicegram.Assistant.MobileData.Description
source: Get mobile data right in the app
pt: Tenha acesso a dados móveis diretamente no aplicativo

# Nicegram.Assistant.NicegramCommunity
source: Nicegram community
pt: Comunidade Nicegram

# Nicegram.Assistant.NicegramCommunity.OfficialChannel
source: Official Channel
pt: Canal oficial

# Nicegram.Assistant.NicegramCommunity.OfficialСhat
source: Official Chat
pt: Chat oficial

# Nicegram.Assistant.Support
source: Support
pt: Suporte

# Nicegram.Assistant.Rate us
source: Rate us
pt: Avalie-nos

# Nicegram.Assistant.Logout
source: Log out
pt: Desconectar-se

# Nicegram.Assistant.Swipe
source: Swipe up to close assistant
pt: Arraste para cima para fechar o assistente

# Nicegram.Assistant.SignIn
source: Sign in
pt: Entrar

# Nicegram.Assistant.SpecialOffer
source: Special offer
pt: Oferta Especial

# Nicegram.Assistant.Hint.Title
source: Nicegram Assistant
pt: Assistente Nicegram

# Nicegram.Assistant.Hint.Subtitle
source: Available features
pt: Recursos disponíveis

# Nicegram.Assistant.Hint.MobileData
source: Mobile Data (eSIM)
pt: Dados móveis (eSIM)

# Nicegram.Assistant.Hint.VirtualNumber
source: Virtual Phone Numbers
pt: Números de telefone virtuais

# Nicegram.Assistant.Hint.Wallet
source: Crypto Wallet
pt: Carteira de criptomoedas

# Nicegram.Assistant.Hint.Support
source: Support
pt: Suporte

# Nicegram.Assistant.Hint.Footer
source: Click on the Assistant icon to find out more
pt: Clique no ícone do Assistente para saber mais

# Nicegram.Assistant.Hint.Comming
source: Coming soon
pt: Em breve

# Nicegram.Login.Title
source: Log in with Email
pt: Fazer login usando e-mail

# Nicegram.Login.Email.Placeholder
source: Enter your email address
pt: Insira seu endereço de e-mail

# Nicegram.Login.Password.Placeholder
source: Enter your password
pt: Insira sua senha

# Nicegram.Login.OrContinue
source: or continue with
pt: ou continue com

# Nicegram.Login.Button
source: Log in
pt: Fazer login

# Nicegram.Login.ForgotPass
source: Forgot password?
pt: Esqueceu sua senha?

# Nicegram.Login.isRegister
source: Not registered yet?
pt: Ainda não é cadastrado?

# Nicegram.Login.SignUp
source: Sign up
pt: Cadastre-se

# Nicegram.Login.Action.Error
source: The password is invalid or the user does not have a password
pt: A senha é inválida ou o usuário não possui uma senha

# Nicegram.ForgotPass.Title
source: Forgot password?
pt: Esqueceu sua senha?

# Nicegram.ForgotPass.Subtitle
source: Enter the email address you've already registered with
pt: Insira o endereço de e-mail com o qual você se cadastrou

# Nicegram.ForgotPass.Email.Placeholder
source: Enter your email address
pt: Insira seu endereço de e-mail

# Nicegram.ForgotPass.Button
source: Send code to email
pt: Enviar código ao e-mail

# Nicegram.Registration.Title
source: Register your account
pt: Crie sua conta

# Nicegram.Registration.Email.Error
source: There is no user record corresponding to this identifier. The user may have been deleted
pt: Não há nenhum registro de usuário que corresponda a esse identificador. O usuário pode ter sido excluído.

# Nicegram.Registration.Password
source: Password
pt: Senha

# Nicegram.Registration.FirstName
source: First Name
pt: Nome

# Nicegram.Registration.LastName
source: Last Name
pt: Sobrenome

# Nicegram.Registration.Button
source: Register
pt: Cadastrar

# Nicegram.Registration.Question
source: Already registered?
pt: Já possui cadastro?

# Nicegram.Registration.LogIn
source: Log in
pt: Fazer login

# Nicegram.Alert.InboxCheck
source: We've sent you a verification email. Check your inbox!
pt: Enviamos um e-mail de verificação. Verifique sua caixa de entrada!

# Nicegram.Alert.Continue
source: Continue
pt: Continuar

# Nicegram.Alert.BaseError
source: Something went wrong. Please try again later
pt: Algo deu errado. Tente novamente mais tarde

# Nicegram.Alert.Success
source: Success!
pt: Sucesso!

# Nicegram.Alert.TryAgain
source: Try again
pt: Tentar novamente

# Nicegram.Install.Title
source: Set up Your Phone
pt: Configure seu telefone

# Nicegram.Install.VideoInstructions.Title
source: Play video instruction
pt: Reproduzir vídeo de instruções

# Nicegram.Install.Manual.Title
source: Install Manually
pt: Instalar manualmente

# Nicegram.Install.Manual.Subtitle
source: Settings → Mobile Data → Add Data Plan
pt: Configurações → Dados Móveis → Adicionar Plano de Dados

# Nicegram.Install.Manual.Scan
source: Scan
pt: Ler

# Nicegram.Install.Manual.Address
source: SM-DP+ Address
pt: Endereço SM-DP+

# Nicegram.Install.Manual.Code
source: Activation code
pt: Código d

# Nicegram.Install.APN.Title
source: Install APN
pt: Instalar APN

# Nicegram.Install.APN.Subtitle
source: Settings → Mobile Data → Plan → SMTH
pt: Configurações → Dados Móveis → Plano → SMTH

# Nicegram.Install.Roaming.Title
source: Turn on Data Roaming
pt: Ativar Roaming de Dados

# Nicegram.Install.Roaming.Subtitle
source: Settings → Mobile Data
pt: Configurações → Dados Móveis

# Nicegram.Install.Roaming.Data
source: Data Roaming
pt: Roaming de dados

# Nicegram.Install.Done
source: Done
pt: Concluído

# Nicegram.QRCode.Title
source: Scan QR
pt: Ler código QR

# Nicegram.QRCode.Description
source: Scan a QR code with your phone camera to activate an eSIM card on your device. Feel free to share the code with others!
pt: Leia um código QR usando a câmera do seu celular para ativar um cartão eSIM em seu dispositivo. Fique à vontade para compartilhar o código com outras pessoas!

# Nicegram.QRCode.Share
source: Share QR code
pt: Compartilhar código QR

# Nicegram.MobileData.Title
source: Mobile Data
pt: Dados móveis

# Nicegram.MobileData.NoData
source: No mobile data purchased so far
pt: Não houve compras de dados móveis até o momento

# Nicegram.MobileData.Action.Add
source: Add mobile data
pt: Adicionar dados móveis

# Nicegram.MobileData.MyEsim.Title
source: My eSIM
pt: Meu eSIM

# Nicegram.MobileData.MyEsim.Worldwide
source: Worldwide
pt: Mundial

# Nicegram.MobileData.MyEsim.Add
source: Add more data
pt: Adicionar mais dados

# Nicegram.MobileData.MyEsim.Duration
source: Duration
pt: Duração

# Nicegram.MobileData.MyEsim.Duration.Status
source: Unlimited
pt: Ilimitado

# Nicegram.MobileData.MyEsim.Status
source: Available
pt: Disponível

# Nicegram.Internet.Trafic
source: Internet traffic
pt: Tráfego de Internet

# Nicegram.Internet.Duration
source: Duration
pt: Duração

# Nicegram.Internet.Number
source: Phone number
pt: Número de telefone

# Nicegram.Internet.Info.Title
source: Additional Information
pt: Informações adicionais

# Nicegram.Internet.Plan.Title
source: Data Plan advantage
pt: Benefício do plano de dados

# Nicegram.Internet.Plan.Description
source: You're given an unlimited access to a high-speed and secure internet connection
pt: Você recebeu acesso ilimitado a uma conexão de internet segura e de alta velocidade

# Nicegram.Internet.Coverage.Title
source: Country coverage
pt: Cobertura de países

# Nicegram.Internet.Coverage.Description
source: This data plan is valid in %@ countries. Please, note that the mobile data prices may vary depending on the country
pt: Este plano de dados é válido em %@ países. Observe que os preços dos dados móveis podem variar dependendo do país

# Nicegram.Internet.Start.Title
source: Getting started
pt: Introdução

# Nicegram.Internet.Start.Description
source: In order to start with eSIM+ top up your balance first and then enjoy seamless internet connection wherever you are
pt: Para começar a usar o eSIM+, carregue seu saldo primeiro e tenha acesso ininterrupto à Internet de onde você estiver

# Nicegram.Internet.Countries.Title
source: Supported countries
pt: Países com suporte

# Nicegram.Internet.Countries.SeeAll
source: See all
pt: Ver tudo

# Nicegram.Internet.Countries.Search
source: Search for the country
pt: Pesquisar pelo país

# Nicegram.AddMobileData.Subtitle
source: Add mobile data now - use it later
pt: Adicione dados móveis agora — use mais tarde

# Nicegram.AddMobileData.Button
source: Get plan for %@
pt: Obtenha um plano para %@

# Nicegram.AddMobileData.Countries
source: Supported countries
pt: Países com suporte

# Nicegram.MobileData.MyEsim.FAQ
source: FAQ
pt: Perguntas Frequentes

# Nicegram.Internet.Number.Included
source: Included
pt: Incluso

# Nicegram.Alert.Copied
source: Copied
pt: Copiado

# Nicegram.Error.NotSupportedDataPlan
source: This data plan is no longer supported
pt: Não há mais suporte para esse plano de dados

# Auth.ErrorUserNotFound
source: There is no user record corresponding to this identifier. The user may have been deleted.
pt: Não há nenhum registro de usuário que corresponda a esse identificador. O usuário pode ter sido excluído.

# Auth.ErrorWrongPassword
source: The password is invalid or the user does not have a password.
pt: A senha é inválida ou o usuário não tem uma senha.

# Auth.ErrorAlreadyInUse
source: The email address is already in use by another account.
pt: O endereço de e-mail já está em uso por outra conta.

# Error.EsimProfileBlocked
source: Your esim profile is blocked
pt: Seu perfil está bloqueado

# Error.EsimProfileExpired
source: Your esim profile is expired
pt: Seu perfil expirou
