Repository: TelegramMessenger/Telegram-iOS
Catalog: Telegram/Telegram-iOS/*.lproj/NiceLocalizable.strings
Languages: de, fa, ro, uk

# ChatFilter.Bots
source: Bots
fa: ربات ها
ro: Boți
uk: Боти

# ChatFilter.Channels
source: Channels
de: Kanäle
fa: کانال‌ ها
ro: Canale
uk: Канали

# ChatFilter.Private
source: Users
de: Benutzer
fa: کاربران
ro: Utilizatori
uk: Користувачі

# ChatFilter.Groups
source: Groups
de: Gruppen
fa: گروه ها
ro: Grupuri
uk: Групи

# ChatFilter.Unread
source: Unread
de: Ungelesen
fa: خوانده نشده
ro: Necitit
uk: Непрочитані

# ChatFilter.Unmuted
source: Unmuted
de: Laut
fa: بیصدا نشده
ro: Unmute
uk: Не заглушені

# ChatFilter.Favourites
source: Favourites
de: Favoriten
fa: علاقه‌ مندی‌ها
ro: Favorite
uk: Обрані

# NiceFeatures.Tabs.Header
source: TABS
fa: زبانه ها
ro: FERESTRE
uk: ВКЛАДКИ

# NiceFeatures.Tabs.ShowContacts
source: Show Contacts Tab
de: Kontakte Tab anzeigen
fa: نمایش برگه مخاطبین
ro: Vizualizare contacte
uk: Показати вкладку Контакти

# NiceFeatures.ChatScreen.Header
source: CHAT SCREEN
de: CHAT ANZEIGE
fa: صفحه چت
ro: AFIȘARE CHAT
uk: ЧАТ

# NiceFeatures.ChatScreen.AnimatedStickers
source: Animated Stickers
de: Animierte Stickers
fa: استیکرهای انیمیشنی
ro: Stickere Animate
uk: Анімовані наліпки

# NiceFeatures.useBackCam
source: Use Rear camera (Round Videos)
de: Verwende Rückkamera (runde Videos)
fa: از دوربین عقب استفاده کنید (فیلم های گرد)
ro: Utilizați camera din spate (videoclipuri rotunde)
uk: Використовувати задню камеру (круглі відео)

# NiceFeatures.Folders.Header
source: FOLDERS
de: ORDNER
uk: ТЕКИ

# NiceFeatures.Folders.TgFolders
source: Folders at bottom
de: Ordner - unten
uk: Теки внизу

# NiceFeatures.Folders.TgFolders.Notice
source: iOS-styled folder list
de: Ordnerliste im iOS-Stil
uk: Список тек в iOS стилі

# NiceFeatures.RoundVideos.Header
source: ROUND VIDEOS
de: RUNDE VIDEOS
uk: КРУГЛІ ВІДЕО

# NiceFeatures.RoundVideos.UseRearCamera
source: Start with rear camera
de: Starte mit umgedrehter Kamera
uk: Запустити задню камеру

# Chat.SaveToCloud
source: Save to Cloud
de: In Cloud speichern
fa: ذخیره در فضای ابری
ro: Salvează în Cloud
uk: Зберегти до хмари

# Chat.OpenPin
source: Show Pin
de: Pin anzeigen
fa: نشان دادن سنجاق
ro: Afișare Pin
uk: Показати PIN-код

# ChatFilter.Admin
source: Admin
de: Administrator
fa: مدیر
ro: Administratori
uk: Адміністратор

# NiceFeatures.Notifications.Fix
source: Disable Unwanted Notifications
de: Ungewünschte Benachrichtigungen deaktivieren
fa: غیرفعال کردن اعلان های ناخواسته
ro: Dezactivare notificări standard
uk: Вимкнути небажані сповіщення

# NiceFeatures.Notifications.FixNotice
source: Useful if you get notifications from muted chats. Reply from notifications, account labels, and media previews will be unavailable.
de: Nützlich, wenn du Benachrichtigungen von stummgeschalteten Chats erhältst. Das Antworten von Benachrichtigungen, Kontobezeichnungen sowie Medienvorschauen werden nicht verfügbar sein.
fa: در صورت دریافت اعلان از گپ های بیصدا مفید است. پاسخ از اعلان ها، برچسب های حساب و پیش نمایش رسانه ها در دسترس نخواهد بود.
ro: Este util dacă primiți notificări de la chat-urile dezactivate. Răspunsul de la notificări, etichetele contului și previzualizările media nu vor fi disponibile.
uk: Корисно, якщо ви отримуєте сповіщення від приглушених чатів. Відповісти на сповіщення, підписки акаунта попередні перегляди будуть недоступними.

# NiceFeatures.Filters.Header
source: FILTERS (TABS)
de: Filter (Tabs)
fa: فیلترها (برگه ها)
ro: FILTRE (FERESTRE)
uk: ФІЛЬТРИ (ВКЛАДКИ)

# NiceFeatures.Filters.Notice
source: Select the number of custom tabs. Long-tap on tab to change filter.
de: Wählen Sie die Anzahl der benutzerdefinierten Tabs. Langes Tippen auf Tab, um den Filter zu ändern.
fa: تعداد برگه ها را انتخاب کنید. برای تغییر فیلتر نوار را حرکت دهید.
ro: Selectați numărul de file personalizate. Apăsați lung pe filă pentru a schimba filtrul.
uk: Виберіть кількість користувацьких вкладок. Довге натискання на вкладку, щоб змінити фільтр.

# NiceFeatures.Filters.ShowBadge
source: Show Badges (Filters)
de: Abzeichen anzeigen (Filter)
ro: Afișați Insigne (Filtre)
uk: Показувати значки (фільтри)

# NiceFeatures.UseClassicInfoUi
source: Classic Chat Info UI (Groups and Channels)
de: Klassische Chat-Info-UI verwenden
fa: استفاده از رابط کاربری کلاسیک چت
uk: Класичний інтерфейс «про чат»

# Common.ExitNow
source: Exit Now
de: Jetzt verlassen
fa: خروج
ro: Ieșiți Acum
uk: Вийти зараз

# Common.Later
source: Later
de: Später
fa: بعدا
ro: Mai târziu
uk: Пізніше

# Common.RestartRequired
source: Restart Required!
de: Neustart erforderlich!
fa: احتیاج به راه اندازی مجدد!
ro: Repornire Necesară!
uk: Необхідно перезапустити програму!

# NiceFeatures.Tabs.ShowNames
source: Show Tab Names
de: Tabnamen anzeigen
fa: نشان دادن برگه اسم ها
ro: Arată Fereastra cu Numele
uk: Показувати назви вкладок

# Chat.ForwardAsCopy
source: Forward As Copy
de: Als Kopie weiterleiten
fa: فروارد بدون نقل قول
ro: Redirecționeaza ca o Copie
uk: Переслати як копію

# Folder.DefaultName
source: Folder
de: Ordner
fa: پوشه
ro: Dosar
uk: Тека

# Folder.New
source: New Folder
de: Neuer Ordner
fa: پوشه جدید
ro: Dosar nou
uk: Нова тека

source: Folder created
de: Ordner erstellt
fa: پوشه ساخته شد
ro: Dosar creat
uk: Теку створено

# Folder.AddToExisting
source: Add to Existing Folder
de: Zu vorhandenem Ordner hinzufügen
fa: به پوشه موجود اضافه شود
ro: Adaugă la un dosar existent
uk: Додати до наявної теки

source: Folder updated
de: Ordner aktualisiert
fa: بروزرسانی پوشه
ro: Dosar actualizat
uk: Теку оновлено

# Folder.Create
source: Create Folder...
de: Ordner erstellen...
fa: ساخت پوشه
ro: Creaţi folderul...
uk: Створити теку...

# Folder.Create.Name
source: Folder Name
de: Ordnername
fa: نام پوشه
ro: Nume folder
uk: Назва теки

# Folder.Create.Placeholder
source: Folder...
de: Ordner...
fa: پوشه...
uk: Тека...

# Folder.LimitExceeded
source: Sorry, you can create no more than 3 custom folders. More folders are available in Premium.
de: Entschuldigung, Sie können nicht mehr als 3 benutzerdefinierte Ordner erstellen. Weitere Ordner sind in Premium verfügbar.
fa: متاسفم،شما بیش از ۳ پوشه نمی‌توانید ایجاد کنید. پوشه های بیشتر بزودی دردسترس خواهند بود.
ro: Ne pare rău, nu puteți crea mai mult de 3 foldere personalizate. Mai multe foldere sunt disponibile achiziţionând varianta Premium.
uk: На жаль, ви можете створити не більше 3 користувальницьких тек. У преміальному доступі більше тек.

# NiceFeatures.HideNumber
source: Hide phone in settings
de: Telefon in den Einstellungen ausblenden
fa: پنهان کردن شماره موبایل در تنظیمات
ro: Ascunde telefonul din setări
uk: Приховати телефон у налаштуваннях

# NGWeb.Blocked
source: Unavailable in Nicegram due to AppStore Guidelines
de: Nicht verfügbar in Nicegram wegen AppStore Richtlinien
fa: به دلیل دستورالعمل های اپ استور ، انجام عملیات در نایس گرام مقدور نیست
ro: Indisponibil în Nicegram datorită Instrucțiunilor din App Store
uk: Недоступно в Nicegram через правила AppStore

# NiceFeatures.Use.DataStorage
source: Please, Use «%1» to configure default browser
de: Bitte verwenden Sie «%1» um den Standardbrowser zu konfigurieren
fa: لطفاً برای تنظیم مرورگر پیش فرض از «%1» استفاده کنید
ro: Pentru a putea folosi, %1 configurațiva browser-ul prestabilit
uk: Будь ласка, використовуйте «%1», щоб налаштувати типовий браузер

# NiceFeatures.Browser.Header
source: URLs
fa: نشانی های اینترنتی
ro: URL-UL
uk: Посилання

# NiceFeatures.Browser.UseBrowser
source: Open links in browser
de: Im Browser öffnen
fa: بازکردن لینک ها در مرورگر
ro: Deschideți în navigator
uk: Відкривати посилання у браузері

# NiceFeatures.Browser.UseBrowserNotice
source: Nicegram will open links in external browser instead of in-app. Selected browser must be installed.
de: Nicegram öffnet Links im externen Browser anstelle von In-App. Der ausgewählte Browser muss installiert sein.
fa: Nicegram بجای خود برنامه، لینک هارا در مرورگر خارجی باز میکند. مرورگر انتخاب شده باید نصب شده باشد.
ro: Nicegram va deschide legături în browser externe în afara aplicație. Browserul selectat trebuie instalat.
uk: Nicegram відкриває посилання у зовнішньому браузері. Вибраний браузер повинен бути встановлений.

# ChatFilter.Missed
source: Missed
de: Verpasst
fa: از دست رفته
ro: Pierdute
uk: Пропущені

# Premium.Title
source: Premium
fa: ویژه
uk: Преміум

# Premium.UnlimitedPins.Header
source: UNLIMITED PINNED CHATS
de: Unbegrenzte Anzahl angepinnter Chats
fa: گفتگو های سنجاق شده نامحدود
ro: CHAT-URI FIXATE NELIMITATE
uk: НЕОБМЕЖЕНІ ЗАКРІПЛЕНІ ЧАТИ

# Premium.SyncPins
source: Sync Pinned Chats
de: Synchronisiere angepinnte Chats
fa: همگام سازی گفتگوهای سنجاق شده
ro: Sincronizați chat-urile fixate (Pinned)
uk: Синхронізувати закріплені чати

# Premium.SyncPins.Notice.ON
source: If you change pinned chats in other client, they WILL CHANGE in Nicegram.
de: Wenn Sie gepinnte Chats in einem anderen Client ändern, werden sie auch in Nicegram geändert.
fa: اگر در برنامه دیگری گفتگو های سنجاق شده را تغییر دهید، آن ها در Nicegram نیز تغییر خواهند کرد.
ro: Dacă schimbați chat-urile fixate în alt client, acestea se vor schimba în Nicegram.
uk: Якщо ви зміните закріплені чати в іншому клієнті, вони ЗМІНЯТЬСЯ в Nicegram.

# Premium.SyncPins.Notice.OFF
source: If you change pinned chats in other client, they WILL NOT CHANGE in Nicegram.
de: Wenn Sie gepinnte Chats in einem anderen Client ändern, werden sie nicht in Nicegram geändert.
fa: اگر در برنامه دیگری گفتگو های سنجاق شده را تغییر دهید، آن ها در Nicegram نیز تغییر نخواهند کرد.
ro: Dacă schimbați chat-urile fixate în alt client, acestea NU SE VOR SCHIMBA în Nicegram.
uk: Якщо ви зміните закріплені чати в іншому клієнті, вони НЕ ЗМІНЯТЬСЯ в Nicegram.

# Premium.Missed.Header
source: Missed messages
de: Verpasste Nachrichten
fa: پیام های از دست رفته
ro: Mesaje ratate
uk: Нові повідомлення

# Premium.Missed
source: Notify on missed messages
de: Bei verpassten Nachrichten benachrichtigen
fa: اطلاع رسانی پیام های از دست رفته
ro: Notificarea mesajelor pierdute
uk: Сповіщати про нові повідомлення

# Premium.Missed.Notice
source: When you open App after long delay (sleeping, studying, etc.), Nicegram will notify you about unread private messages and mentions.
de: Wenn Sie die App nach langer Verzögerung öffnen (Schlafen, Studieren usw.), wird Nicegram Sie über ungelesene private Nachrichten und Erwähnungen informieren.
fa: هنگامی که برنامه را بعد از تأخیر طولانی (خواب ، مطالعه و غیره) باز می کنید، Nicegram در مورد پیام های خصوصی خوانده نشده و منشن شده به شما اطلاع می دهد.
ro: Când deschideți aplicația după o întârziere lungă (dormit, studiat, etc.), Nicegram vă va anunța despre mesaje și mențiuni private necitite.
uk: Коли ви відкриєте додаток після тривалої затримки (сну, навчання тощо), Nicegram повідомить вас про непрочитані особисті повідомлення та згадки.

# Folder.DeleteAsk
source: Delete Folder
de: Ordner löschen
fa: حذف پوشه
ro: Șterge Dosar
uk: Видалити теку

# Folder.NeedPremium
source: This Folder is only available with Premium. You can get Premium or delete Folder with swipe.
de: Dieser Ordner ist nur mit Premium verfügbar. Sie können Premium erwerben oder den Ordner mit Wischen löschen.
fa: دسترسی به این پوشه فقط با عضویت رسمی حقوقمند مقدور می باشد شما میتوانید برای دریافت این حق عضویت اقدام و یا پوشه را با جاروب نمودن ، پاک نمایید.
ro: Acest Dosar este destina doar utilizatorilor Premium. Poți obtine Premium sau șterge Dosarul glisând.
uk: Ця тека доступна тільки з Преміумом. Ви можете отримати Преміум або видалити теку з допомогою свайпу.

# Common.SupportChatUsername
source: nicegramchat
de: nicegram_de
fa: nicegram_fa
uk: nicegram_ukraine

# Common.FAQ.Button
source: Nicegram FAQ
de: Fragen und Antworten
fa: سوالات رایج تلگرام
ro: Nicegram Întrebări frecvente
uk: ЧаПи Nicegram

# Common.FAQ.Intro
source: Please note that Nicegram Support is done by the only developer and community. Firstly, take a look at the Nicegram FAQ: it has important troubleshooting tips and answers to most questions.
de: Bitte beachten Sie, dass der Nicegram Support von einem einzigen Entwickler und der Community durchgeführt wird. Werfen Sie einen Blick auf die Nicegram-FAQ: Sie enthält wichtige Tipps zur Fehlerbehebung und Antworten auf die meisten Fragen.
fa: لطفاً توجه داشته باشید که پشتیبانی Nicegram توسط تنها یک توسعه دهنده و انجمن انجام می شود. در مرحله اول، به سؤالات متداول Nicegram نگاهی بیندازید: دارای نکات مهم عیب یابی و پاسخ بیشتر سوالات است.
ro: Vă rugăm să rețineți că asistența Nicegram este realizată de un singur dezvoltator și de comunitate.
uk: Будь ласка, зверніть увагу, що підтримка Nicegram зроблена єдиним розробником та спільнотою. По-перше, подивіться на ЧаПи Nicegram : у нього є важливі поради з усунення несправностей і відповіді на більшість питань.

# IAP.Premium.Title
source: Premium
fa: ویژه
uk: Преміум

# IAP.Premium.Subtitle
source: Unique features you can't refuse!
de: Einzigartige Funktionen, die du nicht ablehnen kannst!
fa: ویژگی های منحصر به فردی که شما نمیتوانید رد کنید!
ro: Funcții unice pe care nu le poți refuza!
uk: Унікальні функції, від яких важко відмовитися!

# IAP.Premium.Features
source: Quick message Translator Remember selected folder on exit
de: Schnellnachrichten-Übersetzer Ausgewählten Ordner beim Beenden merken
fa: بینهایت پوشه و چت ها سنجاق شده مترجم سریع پیام فیلتر پیام های دیده نشده و مدیریت تب ها خلاصه پیام های جدید در هنگام بارگزاری اپ
ro: Dosare și chat-uri nelimitate Traducere rapidă de mesaje Mesaje pierdute Filtrare și Gestionarea Filelor „Mesaje noi” la lansarea aplicației
uk: Швидка кнопка перекладу Запам'ятати вибрану теку при виході

# IAP.Premium.Activated
source: Premium Activated!
de: Premium aktiviert!
fa: نسخه ویژه فعال شد!
ro: Premium Activat!
uk: Преміум активовано!

# IAP.Common.Restore
source: Restore Purchases
de: Einkäufe wiederherstellen
fa: بازیابی خریدها
ro: Restabiliţi cumpărăturile
uk: Відновити Покупки

# IAP.Common.CantPay
source: Sorry, but you can't make purchases because of your device or account restrictions.
de: Leider können Sie aufgrund Ihres Geräts oder Ihres Kontos keine Einkäufe tätigen.
fa: متأسفیم، اما به دلیل محدودیت دستگاه یا حساب خود نمی توانید خرید کنید.
ro: Ne pare rău, dar nu puteți face achiziții din cauza restricțiilor de pe dispozitiv sau cont.
uk: Вибачте, Ви не можете зробити покупку через ваш пристрій чи обмеження облікового запису.

# IAP.Common.ErrorFetch
source: Sorry, сan't fetch App Store purchases.
de: Entschuldigung, App Store Käufe können nicht abgerufen werden.
fa: متاسفانه خرید از اپ استور مقدور نیست.
ro: Ne pare rău, nu putem prelua achizițiile din App Store.
uk: Вибачте, не вдалося завантажити покупки з App Store.

# IAP.Common.Congrats
source: Congratulations!
de: Herzlichen Glückwunsch!
fa: تبریک میگوییم!
ro: Felicitări!
uk: Вітаємо!

# IAP.Common.ValidateError
source: Sorry, can't validate your purchase.
de: Es tut uns leid, kann Ihren Kauf nicht validieren.
fa: متأسفیم، نمی توانید خرید خود را تأیید کنید.
ro: Ne pare rău, nu putem valida achiziția.
uk: На жаль, не вдалося перевірити вашу покупку.

# IAP.Common.Connecting
source: Connecting to AppStore...
de: Verbinde mit AppStore...
uk: Підключення до AppStore...

# Premium.OnetapTranslate
source: Quick Translate button
de: Schnellübersetzen-Schaltfläche
fa: دکمه ترجمه سریع
ro: Butonul Traducere Rapidă
uk: Переклад

# Premium.IgnoreTranslate.Title
source: Ignored Languages
de: Ignorierte Sprachen
fa: زبان های نادیده گرفته شده
ro: Limbi Ignorate
uk: Ігнорувати мови

# Premium.IgnoreTranslate.Header
source: Quick Translate button will be DISABLED for languages you choose below.
de: Die Schaltfläche Schnellnachrichten-Übersetzung wird für die unten ausgewählten Sprachen DEAKTIVIERT sein.
ro: App will try to detect language of each message. Butonul Traducere rapidă va fi DEZACTIVAT pentru toate limbile pe care le alegeți mai jos.
uk: Переклад буде ВИМКНЕНО для мов, які ви обираєте нижче.

# ManageFilters.Title
source: Manage Tabs
de: Tabs verwalten
fa: مدیریت زبانه ها
ro: Administrează Ferestre
uk: Керування вкладками

# ManageFilters.Header
source: CONFIGURE AVAILABLE FILTERS
de: VERFÜGBAREN FILTER VERFÜGBAREN
fa: فیلترهای موجود را پیکربندی کنید
ro: CONFIGURĂ FILTRELE DISPONIBILE
uk: НАЛАШТУВАННЯ ДОСТУПНІ ФІЛЬТЕРИ

# Messages.Translate
source: Translate
de: Übersetzen
fa: ترجمه
ro: Traduceți
uk: Перекласти

# Messages.UndoTranslate
source: Undo Translate
de: Rückgängig übersetzen
fa: بازگردانی ترجمه
ro: Anulează Traducerea
uk: Скасувати переклад

# Messages.TranslateError
source: Sorry, translation unavailable.
de: Die Übersetzung ist leider nicht verfügbar.
fa: متأسفیم، ترجمه در دسترس نیست.
ro: Ne pare rău, traducere indisponibilă.
uk: На жаль, переклад недоступний.

# NGLab.RegDate.Btn
source: Get Registration Date
de: Anmeldedatum
fa: دریافت تاریخ ثبت نام
ro: Data înregistrării
uk: Отримати дату реєстрації

# NGLab.RegDate.Title
source: Registration Date
de: Anmeldedatum
fa: تاریخ ثبت‌نام
ro: Data înregistrării
uk: Дата реєстрації

# NGLab.RegDate.Notice
source: This is an approximate date
de: Dies ist ein ungefähres Datum
fa: تاریخ به صورت تقریبی درج می شود
ro: Aceasta este o dată aproximată
uk: Це приблизна дата

# NGLab.RegDate.MenuItem
source: registered
de: registriert
fa: ثبت شد
ro: înregistrat
uk: зареєстровано

# NGLab.RegDate.FetchError
source: Sorry, can't get registration date.
de: Leider kann das Registrierungsdatum nicht abgerufen werden.
fa: متاسفانه دریافت تاریخ ثبت نام مقدور نیست.
ro: Ne pare rău, nu putem obține data înregistrării.
uk: На жаль, неможливо отримати дату реєстрації.

# NGLab.BadDeviceToken
source: [iOS 11+] Unable to verify device.
de: [iOS 11+] Gerät kann nicht verifiziert werden.
uk: [iOS 11+] Не вдалося перевірити пристрій.

# NiceFeatures.BackupIcloud
source: Sync Settings & Folders with iCloud
de: Einstellungen & Ordner mit iCloud synchronisieren
ro: Sincronizați Setările și Dosarele cu iCloud
uk: Синхронізувати налаштування та теки з iCloud

# NiceFeatures.BackupSettings
source: Backup Settings & Folders
de: Sicherungseinstellungen & Ordner
fa: تنظیمات پشتیبان گیری و پوشه ها
ro: Copie de rezerva(Backup) Setări & Dosare
uk: Резервного копіювання налаштувань і тек

# NiceFeatures.BackupSettings.Notice
source: Creates backup file. Tap on file to restore.
de: Erstellt Sicherungsdatei. Zum Wiederherstellen auf Datei tippen.
ro: Creează copie de siguranță fișiere. Atingeți fișierul pentru restaurare.
uk: Створити файл резервної копії. Натисніть на файл для відновлення.

# NiceFeatures.BackupSettings.Done
source: Backup sent to Saved Messages
de: Sicherung an gespeicherte Nachrichten gesendet
fa: تهیه نسخه پشتیبان از پیام های ذخیره شده کامل شد
ro: Copie de rezervă facută pentru Mesajele Salvate
uk: Резервне копіювання надіслано до збережених повідомлень

# NiceFeatures.BackupSettings.Error
source: Error creating backup
de: Fehler beim Erstellen der Sicherung
fa: خطا در ایجاد نسخه پشتیبان
ro: Eroare la crearea copiei de rezervă
uk: Помилка при створенні резервної копії

# NiceFeatures.RestoreSettings.Confirm
source: Are you sure you want to restore Folders & Settings from file? ⚠️ It will override current data
de: Sind Sie sicher, dass Sie Ordner & Einstellungen aus der Datei wiederherstellen möchten? ⚠️ Aktuelle Daten werden überschrieben
fa: آیا مطمئن هستید که می خواید فولدر ها و تنظیمات را از فایل بازگردانید؟ ⚠️ اطلاعات فعلی شما جایگزین خواهد شد
ro: Sigur doriți să restaurați folderele și setările din fișier? ⚠️ Va anula datele actuale
uk: Ви дійсно бажаєте відновити теки та налаштування з файлу? ⚠️ дана перевизначить поточні дані

# NiceFeatures.RestoreSettings.Done
source: Folders & Settings succesfully restored
de: Ordner & Einstellungen erfolgreich wiederhergestellt
ro: Dosare & Setarile restaurat cu succes
uk: Теки та параметри успішно відновлені

# NiceFeatures.RestoreSettings.Error
source: Error restoring settings. File may be corrupted
de: Fehler beim Wiederherstellen der Einstellungen. Die Datei könnte beschädigt sein
ro: Eroare restabilire setări. Fișierle pot fi corupte
uk: Помилка відновлення налаштувань. Файл може бути пошкоджений

# Gmod.Restricted
source: You can't send messages in Preview Mode.
de: Du kannst keine Nachrichten im Vorschaumodus senden.
fa: در حالت پیش نمایش نمی توانید پیام ارسال کنید.
uk: Ви не можете надсилати повідомлення в режимі попереднього перегляду.

# Gmod.Unavailable
source: Preview Mode Unavailable
de: Vorschaumodus nicht verfügbar
fa: حالت پیش نمایش در دسترس نیست
uk: Перегляд недоступний

# Gmod.Disable.Notice
source: Your last seen visibility will be set to «%1»
de: Deine zuletzt gesehen Einstellung wird auf ‹‹%1›› gesetzt
uk: Остання видимість буде встановлена в «%1»

# Gmod
source: Preview Mode
de: Vorschaumodus
fa: حالت پیش نمایش
uk: Режим попереднього перегляду

# Gmod.Enable
source: Enable Preview Mode?
de: Vorschaumodus aktivieren?
fa: حالت پیش نمایش فعال شود؟
uk: Увімкнути режим попереднього перегляду?

# Gmod.Disable
source: Disable Preview Mode?
de: Vorschaumodus deaktivieren?
fa: حالت پیش نمایش غیر فعال شود؟
uk: Вимкнути режим попереднього перегляду?

# Gmod.Notice
source: Your online status will be hidden from everyone by Telegram privacy settings. App will show a warning if you're entering a private chat. Your online status may be revealed if you send or type ANY message.
de: Dein Onlinestatus wird über die Telegram Privatsphäre-Einstellungen vor jedem versteckt. Die App zeigt dir eine Warnung, solltest du einen privaten Chat betreten. Nachrichten jeglicher Art können deinen Onlinestatus zeigen.
uk: Ваш онлайн статус буде приховано від усіх налаштувань конфіденційності Telegram. Додаток покаже попередження, якщо ви введете приватний чат. Ваш онлайн-статус може бути показано, якщо ви відправляєте або набираєте БУДЬ-ЯКУ повідомлення.

# SendWithKb
source: Send with «Enter» button
de: Mit «Enter» senden
fa: با دکمه enter بفرست
uk: Надіслати за допомогою кнопки «Enter»

# NiceFeatures.ShowGmodIcon
source: Show Preview Mode icon
de: Icon für Vorschaumodus anzeigen
fa: آیکون پیش نمایش را نشان بده
uk: Показати іконку режиму перегляду

# Gmod.OpenChatQ
source: Open chat?
de: Chat öffnen?
fa: چت را باز کنم؟
uk: Відкрити чат?

# Gmod.OpenChatNotice
source: Chat will be marked as "read", but you can preview chat with a long-tap (force-touch)
de: Der Chat wird als gelesen markiert, du kannst aber durch Force-Touch/halten den Chat im Vorschaumodus öffnen
fa: چت به صورت خوانده شده نشان داده می شود ، ولی شما می توانید پیش نمایش چت را با نگه داشتن طولانی ببیند(لمس طولانی)
uk: Чат буде позначено як "прочитане", але ви можете попередньо переглянути чат довгим дотиком (сильний дотик)

# Gmod.OpenChatBtn
source: Yes, open the chat
de: Ja, Chat öffnen
fa: بله ، چت را باز کن
uk: Так, відкрити чат

# Gmod.DisableBtn
source: Disable warnings
de: Warnungen deaktivieren
fa: هشدار ها را غیر فعال کن
uk: Вимкнути попередження

# NicegramSettings.Other.hidePhoneInSettingsNotice
source: Your number will be hidden in the UI only. To hide it from others, please use Privacy settings.
de: Deine Nummer wird nur in der Benutzeroberfläche versteckt. Um sie vor anderen zu verbergen, verwende bitte die Privatsphäre-Einstellungen.
uk: Ваш номер буде приховано тільки в інтерфейсі. Щоб приховати його від інших, будь ласка, використовуйте налаштування конфіденційності.

# NicegramSettings.Other.showProfileId
source: Show Profile ID
de: Profil-ID anzeigen
uk: Показати ID профілю

# NicegramSettings.Other.showRegDate
source: Show Registration Date
de: Registrierungsdatum anzeigen
uk: Показати дату реєстрації

# Premium.rememberFolderOnExit
source: Remember current folder on exit
de: Aktuellen Ordner beim Beenden merken
uk: Запам’ятати поточну теку при виході

# NiceFeatures.Notifications.HideNotifyAccount
source: Hide account in notification
fa: پنهان کردن اکانت در اطلاع
ro: Ascundeți contul în notificare
